_sdaiWriteRepositoryToFile(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Saves repository to file.
\param repository [in] repository instance
\param fileName [in] file name for save to
\returns returns sdaiTRUE if repository write is succeed in other case returns sdaiFALSE